In [1]:
#%%!
#pip install --trusted-host  pypi.org ipython-sql

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///northwind_lite.db

In [4]:
%%sql
SELECT * FROM Customers LIMIT 5

 * sqlite:///northwind_lite.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')]

In [5]:
%%sql
SELECT * FROM Customers WHERE Country = 'Germany' LIMIT 5

 * sqlite:///northwind_lite.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany'),
 (17, 'Drachenblut Delikatessend', 'Sven Ottlieb', 'Walserweg 21', 'Aachen', '52066', 'Germany'),
 (25, 'Frankenversand', 'Peter Franken', 'Berliner Platz 43', 'München', '80805', 'Germany'),
 (39, 'Königlich Essen', 'Philip Cramer', 'Maubelstr. 90', 'Brandenburg', '14776', 'Germany')]

# Create Table

In [6]:
%%sql
CREATE TABLE first_table(firstname varchar(20),
                         lastname varchar(40));

 * sqlite:///northwind_lite.db
(sqlite3.OperationalError) table first_table already exists
[SQL: CREATE TABLE first_table(firstname varchar(20),
                         lastname varchar(40));]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [7]:
%%sql
SELECT * FROM first_table

 * sqlite:///northwind_lite.db
Done.

[('tolga', 'isik'), ('tolga', 'kasik'), ('TOLGA', 'ISIK'), ('TOLGA', 'ISIKK')]

In [10]:
%%sql
INSERT INTO first_table VALUES('TOLGA', 'ISIKM')

 * sqlite:///northwind_lite.db
1 rows affected.

[]

In [12]:
%%sql
SELECT * FROM first_table

 * sqlite:///northwind_lite.db
Done.

[]

# SELECT